app/views/memes/index.html.erb

            <div class="index-meme-container">
            <%= link_to image_tag(meme.image.url, class: "img-responsive index-meme-img"), meme_path(meme.group.group_slug, meme)%>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."group_slug" = $1 LIMIT 1  [["group_slug", "flatiron-school"]]