app/views/memes/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "meme_tags" ON "tags"."id" = "meme_tags"."tag_id" WHERE "meme_tags"."meme_id" = $1  [["meme_id", 1]]
---
  <div class="row tags">
    <% @meme.tags.each do |tag| %>

SELECT "comments".* FROM "comments" WHERE "comments"."meme_id" = $1  [["meme_id", 1]]
---
        <ul class="commentList">
        <% @meme.comments.each do |comment| %>

SELECT  "groups".* FROM "groups" WHERE "groups"."group_slug" = $1 LIMIT 1  [["group_slug", "flatiron-school"]]
---
    <div class="row show-page-buttons">
      <a href="<%=memes_path(@meme.group.group_slug)%>"><button type="button" class="btn btn-primary">Back to Index</button></a>