app/views/registrations/new.html.erb

SELECT "groups".* FROM "groups"
---
        <%= f.label :groups %>
        <%= f.collection_select :group_ids, Group.all, :id, :title %>