app/controllers/groups_controller.rb

SELECT "users".* FROM "users" INNER JOIN "memberships" ON "users"."id" = "memberships"."user_id" WHERE "memberships"."group_id" = $1  [["group_id", 6]]
---
  def create
    @group = Group.new(group_params)
    @group.group_slug = @group.to_slug
    @group.group_creator = current_user
    #binding.pry
    @group.save
    @group.users << current_user
    redirect_to group_path(@group.group_slug)