app/controllers/groups_controller.rb

  def show
    @group = Group.find_by(group_slug: params[:group_slug])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."group_slug" = $1 LIMIT 1  [["group_slug", "dog-lovers"]]

  def create
    @group = Group.new(group_params)
    @group.group_slug = @group.to_slug
    @group.group_creator = current_user
    @group.save
    Membership.create(group: @group, user: current_user, user_type: "admin")
---
INSERT INTO "groups" ("title", "group_slug", "group_creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "memberships" ("group_id", "user_id", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["group_id", 10], ["user_id", 3], ["user_type", "admin"], ["created_at", "2016-05-21 20:25:57.805313"], ["updated_at", "2016-05-21 20:25:57.805313"]]