app/controllers/memes_controller.rb

SELECT "memes".* FROM "memes" WHERE "memes"."group_id" = 1
---
  def index
    #binding.pry
    # group_slug = params[:group_slug]
    # @group = Group.find_by(group_slug: group_slug)
    @memes = Meme.where(group: @group)

SELECT  "memes".* FROM "memes" WHERE "memes"."group_id" = $1 AND "memes"."id" = $2 LIMIT 1  [["group_id", 1], ["id", 1]]
---
  def show
    @meme = @group.memes.find(params[:id])

INSERT INTO "memes" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "group_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @meme = Meme.create(meme_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."group_slug" = $1 LIMIT 1  [["group_slug", "flatiron-school"]]
---
  def find_group
    @group = Group.find_by(group_slug: params[:group_slug])