app/controllers/memes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "rachelb"]]
---
  def create
    @meme = Meme.new(meme_params)
    @meme.group = Group.find_by(group_slug: params[:group_slug])
    @meme.creator = User.find_by(username: 'rachelb') # CHANGE THIS AFTER USERS EXIST

SELECT "memes".* FROM "memes" WHERE "memes"."group_id" IN (SELECT "groups"."id" FROM "groups" WHERE "groups"."group_slug" = $1)  [["group_slug", "flatiron-school"]]
---
  def set_meme
    @meme = Group.find_by(group_slug: params[:group_slug]).memes.find(params[:id])