app/controllers/registrations_controller.rb

  def new
    if current_user
      flash[:danger] = "You are already logged in."
      redirect_to memes_path(current_user.groups.first.group_slug)
---
SELECT "groups".* FROM "groups"

  def create
    @user = User.new(user_params)
    @user.avatar = user_avatar
    if @user.save
      session[:user_id] = @user.id
      redirect_to memes_path(@user.groups.first.group_slug)
---
INSERT INTO "users" ("username", "email", "password_digest", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "groups".* FROM "groups"