app/controllers/sessions_controller.rb

  def create  #create a session
    # This is the action associated with logging in (post request)
    # This finds the user id and adds it to his/her cookie

    # @user = User.find(params[:user][:id])
    @user = User.find_by(username: user_params[:username])
    if @user.authenticate(user_params[:password])
      #make active sesh, bring up first group of their groups
      session[:user_id] = @user.id
      redirect_to memes_path(@user.groups.first.group_slug)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "rachelb"]]
SELECT  "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = $1  ORDER BY "groups"."id" ASC LIMIT 1  [["user_id", 3]]